In [41]:
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
s = pd.Series(['banana', 42])
s

0    banana
1        42
dtype: object

In [3]:
s = pd.Series(['Wes McKinney', 'Creator of Pandas'], 
              index=['Person', 'Who'])
s

Person         Wes McKinney
Who       Creator of Pandas
dtype: object

In [9]:
pd.Series(['Wes McKinney', 'Creator of Pandas'], 
          index=['Person', 'Who'])

Person         Wes McKinney
Who       Creator of Pandas
dtype: object

In [5]:
pd.Series({'Person':'Wes McKinney', 'Who':'Creator of Pandas'})

Person         Wes McKinney
Who       Creator of Pandas
dtype: object

In [11]:
pd.Series({'Person':'Wes McKinney', 'Who':'Creator of Pandas'}, 
          index=['Who', 'Person'])

Who       Creator of Pandas
Person         Wes McKinney
dtype: object

In [13]:
scientists = pd.DataFrame({
                'Name': ['Rosaline Franklin', 'William Gosset'],
                'Occupation': ['Chemist', 'Statistician'],
                'Born': ['1920-07-25', '1876-06-13'],
                'Died': ['1958-04-16', '1937-10-16'],
                'Age': [37, 61]
             })
scientists

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [19]:
from collections import OrderedDict
scientists = pd.DataFrame(OrderedDict([
                ('Name', ['Rosaline Franklin', 'William Gosset']),
                ('Occupation', ['Chemist', 'Statistician']),
                ('Born', ['1920-07-25', '1876-06-13']),
                ('Died', ['1958-04-16', '1937-10-16']),
                ('Age', [37, 61])
             ]))
scientists

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [21]:
scientists = pd.DataFrame(
                data={
                'Occupation': ['Chemist', 'Statistician'],
                'Born': ['1920-07-25', '1876-06-13'],
                'Died': ['1958-04-16', '1937-10-16'],
                'Age': [37, 61]}, 
                index=['Rosaline Franklin', 'William Gosset'],
                columns=['Occupation', 'Born', 'Died', 'Age'])
scientists

                     Occupation        Born        Died  Age
Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
William Gosset     Statistician  1876-06-13  1937-10-16   61

In [24]:
first_row = scientists.loc['William Gosset']
print(type(first_row))
display(first_row)
display(first_row.index)
display(first_row.values)
display(first_row.keys())

<class 'pandas.core.series.Series'>

Occupation    Statistician
Born            1876-06-13
Died            1937-10-16
Age                     61
Name: William Gosset, dtype: object

Index(['Occupation', 'Born', 'Died', 'Age'], dtype='object')

array(['Statistician', '1876-06-13', '1937-10-16', 61], dtype=object)

Index(['Occupation', 'Born', 'Died', 'Age'], dtype='object')

In [25]:
first_row.index[0]

'Occupation'

In [26]:
first_row.keys()[0]

'Occupation'

In [35]:
first_row.dtype

dtype('O')

In [36]:
first_row.T

Occupation    Statistician
Born            1876-06-13
Died            1937-10-16
Age                     61
Name: William Gosset, dtype: object

In [37]:
ages = scientists['Age']
ages

Rosaline Franklin    37
William Gosset       61
Name: Age, dtype: int64

In [38]:
display(ages.mean())
display(ages.min())
display(ages.max())
display(ages.std())

49.0

37

61

16.97056274847714

In [39]:
ages.describe()

count     2.000000
mean     49.000000
std      16.970563
min      37.000000
25%      43.000000
50%      49.000000
75%      55.000000
max      61.000000
Name: Age, dtype: float64

In [47]:
scientists = pd.read_csv('../data/scientists.csv')
ages = scientists['Age']
display(ages)
ages.describe()

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

count     8.000000
mean     59.125000
std      18.325918
min      37.000000
25%      44.000000
50%      58.500000
75%      68.750000
max      90.000000
Name: Age, dtype: float64

In [48]:
ages.mean()

59.125

In [49]:
ages[ages > ages.mean()]

1    61
2    90
3    66
7    77
Name: Age, dtype: int64

In [50]:
ages > ages.mean()

0    False
1     True
2     True
3     True
4    False
5    False
6    False
7     True
Name: Age, dtype: bool

In [51]:
type(ages > ages.mean())

pandas.core.series.Series

In [52]:
manual_bool_values = [True, True, False, False, True, True, False, True]
ages[manual_bool_values]

0    37
1    61
4    56
5    45
7    77
Name: Age, dtype: int64

In [53]:
ages + ages

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [54]:
ages * ages

0    1369
1    3721
2    8100
3    4356
4    3136
5    2025
6    1681
7    5929
Name: Age, dtype: int64

In [55]:
ages + 100

0    137
1    161
2    190
3    166
4    156
5    145
6    141
7    177
Name: Age, dtype: int64

In [56]:
ages * 2

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [57]:
ages + pd.Series([1, 100])

0     38.0
1    161.0
2      NaN
3      NaN
4      NaN
5      NaN
6      NaN
7      NaN
dtype: float64

In [58]:
print(ages)

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [61]:
rev_ages = ages.sort_index(ascending=False)
rev_ages

7    77
6    41
5    45
4    56
3    66
2    90
1    61
0    37
Name: Age, dtype: int64

In [60]:
ages * 2

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [62]:
ages + rev_ages

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [63]:
scientists[scientists['Age'] > scientists['Age'].mean()]

                   Name        Born        Died  Age     Occupation
1        William Gosset  1876-06-13  1937-10-16   61   Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

In [64]:
scientists.loc[[True, True, False, True]]

                Name        Born        Died  Age    Occupation
0  Rosaline Franklin  1920-07-25  1958-04-16   37       Chemist
1     William Gosset  1876-06-13  1937-10-16   61  Statistician
3        Marie Curie  1867-11-07  1934-07-04   66       Chemist

In [65]:
scientists.head()

                   Name        Born        Died  Age    Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37       Chemist
1        William Gosset  1876-06-13  1937-10-16   61  Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90         Nurse
3           Marie Curie  1867-11-07  1934-07-04   66       Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56     Biologist

In [66]:
first_half = scientists[:4]
second_half = scientists[4:]
display(first_half)
display(second_half)

                   Name        Born        Died  Age    Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37       Chemist
1        William Gosset  1876-06-13  1937-10-16   61  Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90         Nurse
3           Marie Curie  1867-11-07  1934-07-04   66       Chemist

            Name        Born        Died  Age          Occupation
4  Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5      John Snow  1813-03-15  1858-06-16   45           Physician
6    Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7   Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [67]:
scientists * 2

,Name,Born,Died,Age,Occupation
0,Rosaline FranklinRosaline Franklin,1920-07-251920-07-25,1958-04-161958-04-16,74,ChemistChemist
1,William GossetWilliam Gosset,1876-06-131876-06-13,1937-10-161937-10-16,122,StatisticianStatistician
2,Florence NightingaleFlorence Nightingale,1820-05-121820-05-12,1910-08-131910-08-13,180,NurseNurse
3,Marie CurieMarie Curie,1867-11-071867-11-07,1934-07-041934-07-04,132,ChemistChemist
4,Rachel CarsonRachel Carson,1907-05-271907-05-27,1964-04-141964-04-14,112,BiologistBiologist
5,John SnowJohn Snow,1813-03-151813-03-15,1858-06-161858-06-16,90,PhysicianPhysician
6,Alan TuringAlan Turing,1912-06-231912-06-23,1954-06-071954-06-07,82,Computer ScientistComputer Scientist
7,Johann GaussJohann Gauss,1777-04-301777-04-30,1855-02-231855-02-23,154,MathematicianMathematician

In [68]:
print(scientists['Born'].dtype)
print(scientists['Died'].dtype)

object
object

In [71]:
scientists['Born'] = pd.to_datetime(scientists['Born'], format='%Y-%m-%d')
print(scientists['Born'].dtype)
print(scientists['Born'])

datetime64[ns]
0   1920-07-25
1   1876-06-13
2   1820-05-12
3   1867-11-07
4   1907-05-27
5   1813-03-15
6   1912-06-23
7   1777-04-30
Name: Born, dtype: datetime64[ns]

In [73]:
scientists['Died'] = pd.to_datetime(scientists['Died'], format='%Y-%m-%d')
scientists['Died']

0   1958-04-16
1   1937-10-16
2   1910-08-13
3   1934-07-04
4   1964-04-14
5   1858-06-16
6   1954-06-07
7   1855-02-23
Name: Died, dtype: datetime64[ns]

In [75]:
scientists.dtypes

Name                  object
Born          datetime64[ns]
Died          datetime64[ns]
Age                    int64
Occupation            object
dtype: object

In [79]:
import random
random.seed(42)
random.shuffle(scientists['Age'])

In [80]:
scientists['Age'] = scientists['Age'].sample(len(scientists['Age']), random_state=24).reset_index(drop=True)
scientists['Age']

0    90
1    45
2    77
3    37
4    41
5    61
6    56
7    66
Name: Age, dtype: int64

In [81]:
scientists['age_days_dt'] = scientists['Died'] - scientists['Born']
scientists

,Name,Born,Died,Age,Occupation,age_days_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,90,Chemist,13779 days
1,William Gosset,1876-06-13,1937-10-16,45,Statistician,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,77,Nurse,32964 days
3,Marie Curie,1867-11-07,1934-07-04,37,Chemist,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,41,Biologist,20777 days
5,John Snow,1813-03-15,1858-06-16,61,Physician,16529 days
6,Alan Turing,1912-06-23,1954-06-07,56,Computer Scientist,15324 days
7,Johann Gauss,1777-04-30,1855-02-23,66,Mathematician,28422 days

In [82]:
scientists['age_years_dt'] = scientists['age_days_dt'].astype('timedelta64[Y]')
scientists

,Name,Born,Died,Age,Occupation,age_days_dt,age_years_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,90,Chemist,13779 days,37.0
1,William Gosset,1876-06-13,1937-10-16,45,Statistician,22404 days,61.0
2,Florence Nightingale,1820-05-12,1910-08-13,77,Nurse,32964 days,90.0
3,Marie Curie,1867-11-07,1934-07-04,37,Chemist,24345 days,66.0
4,Rachel Carson,1907-05-27,1964-04-14,41,Biologist,20777 days,56.0
5,John Snow,1813-03-15,1858-06-16,61,Physician,16529 days,45.0
6,Alan Turing,1912-06-23,1954-06-07,56,Computer Scientist,15324 days,41.0
7,Johann Gauss,1777-04-30,1855-02-23,66,Mathematician,28422 days,77.0

In [83]:
scientists.columns

Index(['Name', 'Born', 'Died', 'Age', 'Occupation', 'age_days_dt',
       'age_years_dt'],
      dtype='object')

In [84]:
scientists_dropped = scientists.drop(['Age'], axis=1)
scientists_dropped.columns

Index(['Name', 'Born', 'Died', 'Occupation', 'age_days_dt', 'age_years_dt'], dtype='object')

In [85]:
names = scientists['Name']
names

0       Rosaline Franklin
1          William Gosset
2    Florence Nightingale
3             Marie Curie
4           Rachel Carson
5               John Snow
6             Alan Turing
7            Johann Gauss
Name: Name, dtype: object

In [87]:
names.to_pickle('../data/scientists_names_series.pickle')

In [88]:
scientists.to_pickle('../data/scientists_df.pickle')

In [89]:
scientists_names_from_pickle = pd.read_pickle('../data/scientists_names_series.pickle')
scientists_names_from_pickle

0       Rosaline Franklin
1          William Gosset
2    Florence Nightingale
3             Marie Curie
4           Rachel Carson
5               John Snow
6             Alan Turing
7            Johann Gauss
Name: Name, dtype: object

In [90]:
scientists_from_pickle = pd.read_pickle('../data/scientists_df.pickle')
scientists_from_pickle

,Name,Born,Died,Age,Occupation,age_days_dt,age_years_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,90,Chemist,13779 days,37.0
1,William Gosset,1876-06-13,1937-10-16,45,Statistician,22404 days,61.0
2,Florence Nightingale,1820-05-12,1910-08-13,77,Nurse,32964 days,90.0
3,Marie Curie,1867-11-07,1934-07-04,37,Chemist,24345 days,66.0
4,Rachel Carson,1907-05-27,1964-04-14,41,Biologist,20777 days,56.0
5,John Snow,1813-03-15,1858-06-16,61,Physician,16529 days,45.0
6,Alan Turing,1912-06-23,1954-06-07,56,Computer Scientist,15324 days,41.0
7,Johann Gauss,1777-04-30,1855-02-23,66,Mathematician,28422 days,77.0

In [92]:
scientists.to_csv('../data/scientists_df.tsv', sep='\t', index=False)

In [94]:
df2 = pd.read_csv('../data/scientists_df.tsv', sep='\t')
df2

,Name,Born,Died,Age,Occupation,age_days_dt,age_years_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,90,Chemist,13779 days 00:00:00.000000000,37.0
1,William Gosset,1876-06-13,1937-10-16,45,Statistician,22404 days 00:00:00.000000000,61.0
2,Florence Nightingale,1820-05-12,1910-08-13,77,Nurse,32964 days 00:00:00.000000000,90.0
3,Marie Curie,1867-11-07,1934-07-04,37,Chemist,24345 days 00:00:00.000000000,66.0
4,Rachel Carson,1907-05-27,1964-04-14,41,Biologist,20777 days 00:00:00.000000000,56.0
5,John Snow,1813-03-15,1858-06-16,61,Physician,16529 days 00:00:00.000000000,45.0
6,Alan Turing,1912-06-23,1954-06-07,56,Computer Scientist,15324 days 00:00:00.000000000,41.0
7,Johann Gauss,1777-04-30,1855-02-23,66,Mathematician,28422 days 00:00:00.000000000,77.0

In [95]:
import xlwt # for xls"
import openpyxl # for xlsx
names_df = names.to_frame()
names_df.to_excel('../data/scientists_names_series_df.xls')
names_df.to_excel('../data/scientists_names_series_df.xlsx')
scientists.to_excel('../data/scientists_df.xslx', sheet_name='scientists', index=False)

ModuleNotFoundError: No module named 'xlwt'